IDEA StatiCa Open Model
IDEAProgressReport Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Data for progress report of IOM
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Message.IDEAProgressReport
 Namespace: IdeaRS.OpenModel.Message
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class IDEAProgressReport
Public Class IDEAProgressReport
public ref class IDEAProgressReport
The IDEAProgressReport type exposes the following members.
Constructors
Name | Description
IDEAProgressReport
Initializes a new instance of the IDEAProgressReport class
Top
Properties
Name | Description
CurrentProgressAmount
 current progress
CurrentProgressMessage
 some message to pass to the UI of current progress
TotalProgressAmount
 total progress
Top
See Also
Reference
IdeaRS.OpenModel.Message Namespace